fio-test/results/write_out_jobs_conv/128k-psync-2.out
job1: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 14 processes

job1: (groupid=0, jobs=14): err= 0: pid=15287: Sat Jul 27 20:02:17 2024
  write: IOPS=22.9k, BW=2857MiB/s (2996MB/s)(1178GiB/422191msec); 0 zone resets
    clat (usec): min=79, max=17654, avg=603.60, stdev=127.45
     lat (usec): min=83, max=17658, avg=609.90, stdev=128.07
    clat percentiles (usec):
     |  1.00th=[  445],  5.00th=[  469], 10.00th=[  482], 20.00th=[  502],
     | 30.00th=[  523], 40.00th=[  545], 50.00th=[  594], 60.00th=[  652],
     | 70.00th=[  668], 80.00th=[  685], 90.00th=[  709], 95.00th=[  758],
     | 99.00th=[ 1045], 99.50th=[ 1434], 99.90th=[ 1565], 99.95th=[ 1614],
     | 99.99th=[ 2114]
   bw (  MiB/s): min= 2141, max= 4292, per=100.00%, avg=2860.53, stdev=26.97, samples=11802
   iops        : min=17126, max=34336, avg=22881.80, stdev=215.77, samples=11802
  lat (usec)   : 100=0.01%, 250=0.05%, 500=19.15%, 750=75.37%, 1000=4.33%
  lat (msec)   : 2=1.09%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=1.80%, sys=2.60%, ctx=9650033, majf=0, minf=242
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,9649920,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2857MiB/s (2996MB/s), 2857MiB/s-2857MiB/s (2996MB/s-2996MB/s), io=1178GiB (1265GB), run=422191-422191msec

Disk stats (read/write):
    dm-0: ios=48/9648854, merge=0/0, ticks=8/5627380, in_queue=5627388, util=100.00%, aggrios=11/2894976, aggrmerge=0/0, aggrticks=1/118162, aggrin_queue=118163, aggrutil=100.00%
  nvme0n1: ios=0/964992, merge=0/0, ticks=0/43030, in_queue=43030, util=100.00%
  nvme3n1: ios=0/964992, merge=0/0, ticks=0/44712, in_queue=44711, util=100.00%
  nvme1n2: ios=26/4824960, merge=0/0, ticks=2/190529, in_queue=190532, util=100.00%
  nvme2n1: ios=0/964992, merge=0/0, ticks=0/44815, in_queue=44815, util=100.00%
  nvme0n2: ios=36/4824960, merge=0/0, ticks=2/185612, in_queue=185614, util=100.00%
  nvme5n1: ios=0/964992, merge=0/0, ticks=0/44907, in_queue=44908, util=100.00%
  nvme3n2: ios=18/4824960, merge=0/0, ticks=2/193224, in_queue=193225, util=100.00%
  nvme1n1: ios=0/964992, merge=0/0, ticks=0/43591, in_queue=43591, util=100.00%
  nvme2n2: ios=20/4824960, merge=0/0, ticks=3/196602, in_queue=196604, util=100.00%
  nvme5n2: ios=12/4824960, merge=0/0, ticks=2/194606, in_queue=194607, util=100.00%